tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/versions'
brew 'python3'
brew 'postgresql'
brew 'git'
brew 'git-lfs'
brew 'gnupg'
brew 'htop'
brew 'httpie'
brew 'mackup'
brew 'mas'
brew 'nvm'
brew 'pv'
brew 'redis'
brew 'ssh-copy-id'
brew 'supervisor'
brew 'tmux'
brew 'wget'
cask 'processing2'
