tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
# Load/unload environment variables based on $PWD
brew "direnv"
# Improved top (interactive process viewer)
brew "htop"
# Pretty, minimal and fast ZSH prompt
brew "pure"
# Terminal multiplexer
brew "tmux"
# Next-generation plugin manager for zsh
brew "zplug"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# App to build and share containerized applications and microservices
cask "docker"
# Desktop client for GitHub repositories
cask "github"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Software for Logitech devices
cask "logitech-options"
# App to write, plan, collaborate, and get organized
cask "notion"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
