tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Linter/analyzer for Makefiles
brew "checkmake"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Top-like interface for container metrics
brew "ctop"
# Load/unload environment variables based on $PWD
brew "direnv"
# Improved top (interactive process viewer)
brew "htop"
# Tool to measure maximum TCP and UDP bandwidth
brew "iperf"
# Modern and intuitive terminal-based text editor
brew "micro"
# Fast, highly customisable system info script
brew "neofetch"
# Port scanning utility for large networks
brew "nmap"
# Pretty, minimal and fast ZSH prompt
brew "pure"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Next-generation plugin manager for zsh
brew "zplug"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Feature-rich syntax highlighting for Zsh
brew "zsh-fast-syntax-highlighting"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Chromium based browser
cask "arc"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# Utilities designed to make common development tasks easier
cask "devtoys"
# App to build and share containerized applications and microservices
cask "docker"
# Reimagine your terminal
cask "fig"
# Desktop client for GitHub repositories
cask "github"
# Client for the Google Drive storage service
cask "google-drive"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Software for Logitech devices
cask "logitech-options"
# Clipboard manager
cask "maccy"
# App to write, plan, collaborate, and get organized
cask "notion"
# WebKit based web browser
cask "orion"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Mesh VPN based on Wireguard
cask "tailscale"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
